In [ ]:
'''
Topic: Demonstrate possible missing value analysis(used mean and median) approaches using any real world data.
Dataset: train.csv
'''

In [1]:
import numpy as np #Importing NumPy library
import pandas as pd #Importing pandas library

In [2]:
#1.Dropping the missing values(NaN) and filling them with mean of non null values.

In [3]:
#Drop the missing values.

In [4]:
train_mean=pd.read_csv('train.csv') #Reads the csv file at the specified location.

In [5]:
train_mean.info() #This will tell us the total number of non null observations present including the total number of entries.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          50 non-null     int64
 1   Order ID        50 non-null     int64
 2   Order Quantity  42 non-null     float64
 3   Sales           41 non-null     float64
 4   profit          45 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 2.1 KB

In [6]:
train_mean.head(10) #It gives the output of the first 10 rows of the data.

   Row ID  Order ID  Order Quantity      Sales  profit
0       1         3             7.0   261.5400    0.80
1       2         6             6.0    -6.9300     NaN
2       3        32           -90.0  2808.0800    0.65
3       4        32             NaN  1761.4000    0.72
4       5        32             NaN        NaN    0.60
5       6        32            15.0   140.5600    0.60
6       7        35           -30.0   288.5600     NaN
7       8        35            14.0  1892.8480     NaN
8       9        36            46.0  2484.7455    0.55
9      10        65           -32.0        NaN    0.49

In [7]:
train_mean.isnull().sum() #It tells us the total number of NaN values in the data.

Row ID            0
Order ID          0
Order Quantity    8
Sales             9
profit            5
dtype: int64

In [8]:
df_mean=train_mean.dropna() #It deletes all rows where NaN is found.
df_mean.info() #Gives the information 50 entries are reduced to 31. So there were 19 rows in 50 which had NaN value.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31 entries, 0 to 49
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          31 non-null     int64
 1   Order ID        31 non-null     int64
 2   Order Quantity  31 non-null     float64
 3   Sales           31 non-null     float64
 4   profit          31 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 1.5 KB

In [9]:
#Fill the missing values with mean of the non null values

In [10]:
mean_value_OQ=train_mean['Order Quantity'].mean() #Finds the mean value of the non null values in the Order Quantity column.
train_mean['Order Quantity']=train_mean['Order Quantity'].fillna(mean_value_OQ) #Replaces NaN values with the output mean.
print(mean_value_OQ)

19.738095238095237

In [11]:
mean_value_Sales=train_mean['Sales'].mean() #Finds the mean value of the non null values in the Sales column.
train_mean['Sales']=train_mean['Sales'].fillna(mean_value_Sales) #Replaces NaN values with the output mean.
print(mean_value_Sales)

1331.8720975609756

In [12]:
mean_value_profit=train_mean['profit'].mean() #Finds the mean value of the non null values in the profit column.
train_mean['profit']=train_mean['profit'].fillna(mean_value_profit) #Replaces NaN values with the output mean.
print(mean_value_profit)

0.5546666666666666

In [13]:
train_mean.head(10) #All the NaN values are now replaced with the mean of the respective columns.

   Row ID  Order ID  Order Quantity        Sales    profit
0       1         3        7.000000   261.540000  0.800000
1       2         6        6.000000    -6.930000  0.554667
2       3        32      -90.000000  2808.080000  0.650000
3       4        32       19.738095  1761.400000  0.720000
4       5        32       19.738095  1331.872098  0.600000
5       6        32       15.000000   140.560000  0.600000
6       7        35      -30.000000   288.560000  0.554667
7       8        35       14.000000  1892.848000  0.554667
8       9        36       46.000000  2484.745500  0.550000
9      10        65      -32.000000  1331.872098  0.490000

In [14]:
train_mean.info() #Now we don't have any NaN values so all columns have 50 non null values.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          50 non-null     int64
 1   Order ID        50 non-null     int64
 2   Order Quantity  50 non-null     float64
 3   Sales           50 non-null     float64
 4   profit          50 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 2.1 KB

In [15]:
#2.Dropping the missing values(NaN) and filling them with median of non null values.

In [16]:
#Drop the missing values.

In [17]:
train_median=pd.read_csv('train.csv') #Reads the csv file at the specified location.

In [18]:
train_median.info() #This will tell us the total number of non null observations present including the total number of entries.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          50 non-null     int64
 1   Order ID        50 non-null     int64
 2   Order Quantity  42 non-null     float64
 3   Sales           41 non-null     float64
 4   profit          45 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 2.1 KB

In [19]:
train_median.head(10) #It gives the output of the first 10 rows of the data.

   Row ID  Order ID  Order Quantity      Sales  profit
0       1         3             7.0   261.5400    0.80
1       2         6             6.0    -6.9300     NaN
2       3        32           -90.0  2808.0800    0.65
3       4        32             NaN  1761.4000    0.72
4       5        32             NaN        NaN    0.60
5       6        32            15.0   140.5600    0.60
6       7        35           -30.0   288.5600     NaN
7       8        35            14.0  1892.8480     NaN
8       9        36            46.0  2484.7455    0.55
9      10        65           -32.0        NaN    0.49

In [20]:
train_median.isnull().sum() #It tells us the total number of NaN values in the data.

Row ID            0
Order ID          0
Order Quantity    8
Sales             9
profit            5
dtype: int64

In [21]:
df_median=train_median.dropna() #It deletes all rows where NaN is found.
df_median.info() #Gives the information 50 entries are reduced to 31. So there were 19 rows in 50 which had NaN value.

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31 entries, 0 to 49
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          31 non-null     int64
 1   Order ID        31 non-null     int64
 2   Order Quantity  31 non-null     float64
 3   Sales           31 non-null     float64
 4   profit          31 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 1.5 KB

In [22]:
#Fill the missing values with median of the non null values.

In [23]:
median_value_OQ=train_median['Order Quantity'].median() #Finds the median value of the non null values in the Order Quantity column.
train_median['Order Quantity']=train_median['Order Quantity'].fillna(median_value_OQ) #Replaces NaN values with the output median.
print(median_value_OQ)

24.0

In [24]:
median_value_Sales=train_median['Sales'].median() #Finds the median value of the non null values in the Sales column.
train_median['Sales']=train_median['Sales'].fillna(median_value_Sales) #Replaces NaN values with the output median.
print(median_value_Sales)

329.03

In [25]:
median_value_profit=train_median['profit'].median() #Finds the median value of the non null values in the profit column.
train_median['profit']=train_median['profit'].fillna(median_value_Sales) #Replaces NaN values with the output median.
print(median_value_profit)

0.58

In [26]:
train_median.head(10) #All the NaN values are now replaced with the median of the respective columns.

   Row ID  Order ID  Order Quantity      Sales  profit
0       1         3             7.0   261.5400    0.80
1       2         6             6.0    -6.9300  329.03
2       3        32           -90.0  2808.0800    0.65
3       4        32            24.0  1761.4000    0.72
4       5        32            24.0   329.0300    0.60
5       6        32            15.0   140.5600    0.60
6       7        35           -30.0   288.5600  329.03
7       8        35            14.0  1892.8480  329.03
8       9        36            46.0  2484.7455    0.55
9      10        65           -32.0   329.0300    0.49

In [27]:
train_median.info() #Now we don't have any NaN values so all columns have 50 non null values.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Row ID          50 non-null     int64
 1   Order ID        50 non-null     int64
 2   Order Quantity  50 non-null     float64
 3   Sales           50 non-null     float64
 4   profit          50 non-null     float64
dtypes: float64(3), int64(2)
memory usage: 2.1 KB